Repository: nbfalcon/gtk-print
Catalog: po/*.po
Languages: de

source: Specify how the password of an encrypted document will be queried. Defaults to gui. Possible values are: - 'none': do not query the password and fail if the file is encrypted - 'getpass': use the POSIX getpass() function to acquire the password - 'getpass-cli': like 'getpass', but with a fixed prompt - 'gui': get the password with a graphical dialog
de: Gib an wie das Password eines Kennwortgeschützten Dokuments abgefragt werden soll. Standardmäßig "gui". Mögliche Werte sind: - 'none': Frage das Password nicht ab - 'getpass': Benutze die POSIX getpass() Funktion um das Password abzufragen - 'getpass-cli': Wie 'getpass', aber mit einem festgelegten Dialog - 'gui': Frage mithilfe eines grafischen Dialogs nach dem Passwort

source: method
de: Methode

source: Set a password that is tried before prompting the user.
de: Setze das Passwort, welches probiert wird, bevor der Nutzer gefragt wird.

source: password
de: Kennwort

source: Set the file to store print settings.
de: Gib die Datei in, welcher die Druckeinstellungen gespeichert werden.

source: base-settings-file
de: Druckeinstellungsdatei

source: Set the file from which the print settings will be loaded.
de: Gib die Datei an, aus welcher die Druckeinstellungen geladen werden.

source: file
de: Datei

source: Set the file to which the print settings will be saved on a successful print.
de: Setze die Datei, in welcher die Druckdialogseinstellungen nach einem erfolgreichen Druck gespeichert werden.

source: settings
de: Einstellungen

source: Save the print settings even if the user presses "Cancel".
de: Speichere die Druckeinstellung auch wenn der Nutzer im Dialog ablehnt.

source: Specify what is to be done. Can be either 'print', 'preview' or 'dialog'
de: Wähle, was das Programm tun soll. Möglichkeiten sind: - 'print': drucke das angegebene Dokument direkt, ohne einen Druckdialog zu erstellen - 'preview': zeige das Dokument an, ohne einen Druckdialog zu erstellen - 'dialog': erstelle einen GTK-basierten Druckdialog

source: action
de: Aktion

source: Fork and exit after opening the specified document.
de: Rufe fork() auf und schließe den main-thread nachdem das angegebene Dokument geöffnet worden ist.

source: error: parsing arguments failed: %s
de: Fehler: Das Parsen der Argumente scheiterte: %s

source: error: invalid password input method '%s'
de: Fehler: Die Angegebene Kennwortabfragemethode '%s' ist nicht bekannt.

source: usage: %s [options...] document
de: Verwendung: %s [Optionen...] [Dokument]

source: error: failed to open document: %s
de: Fehler: Das Dokument konnte nicht geöffnet werden: %s

source: error: fork failed
de: Fehler: fork() scheiterte

source: error: failed to load print settings: %s
de: Fehler: Die Druckeinstellungen konnten nicht geladen werden: %s

source: error: failed to parse print action '%s'
de: Fehler: Die Druckaktion '%s' ist unbekannt.

source: error: printing failed: %s
de: Fehler: Das Drucken scheiterte: %s

source: error: failed to save print settings: %s
de: Fehler: Die Druckeinstellungen konnten nicht gespeichert werden: %s

source: Password required
de: Ein Kennwort wird benötigt

source: The document “%s“ is locked and requires a password before it can be printed.
de: Das Dokument “%s“ ist Kennwortgeschützt und braucht ein Password um ausgedruckt zu werden.

source: Unlock
de: Freischalten

source: Password:
de: Kennwort:

source: Document password:
de: Kennwort für das Dokument:
